{
    "title": "Calculator",
    "description": "Provides BMI, TDEE, body fat percentage and other calculation functions.",
    "bmi": {
        "bmi_calculator": "BMI Calculator",
        "description": "Calculate Body Mass Index (BMI).",
        "bmi_1": "Since BMI does not account for body fat percentage, a person with a high BMI may not necessarily be obese. For example, bodybuilders may have a BMI over 30 due to their higher proportion of muscle mass. If their body fat percentage is low, they may not need to lose weight. This indicates that BMI is only a rough indicator and cannot fully reflect body composition and health status.",
        "severe_thinness": "Underweight (Severe thinness)",
        "moderate_thinness": "Underweight (Moderate thinness)",
        "mild_thinness": "Underweight (Mild thinness)",
        "adult_bmi": "Adult BMI",
        "normal": "Normal weight",
        "overweight": "Overweight (Pre-obese)",
        "obese_class_i": "Obese Class I (Mild obesity)",
        "obese_class_ii": "Obese Class II (Moderate obesity)",
        "obese_class_iii": "Obese Class III (Severe obesity)",
        "bmi_2": "BMI Prime allows us to quickly assess the difference between a person's BMI and the upper limit of normal BMI. It can also compare populations with different BMI upper limits. People with a BMI Prime below 0.74 are classified as underweight; from 0.74 to 1 is classified as normal, above 1 is classified as overweight, and above 1.2 is classified as obese.",
        "limitations_of_bmi": "Limitations of BMI",
        "bmi_3": "While BMI is a commonly used indicator to assess an individual's overall weight status, it has some limitations to consider. BMI primarily reflects overall weight and cannot distinguish between different tissues (such as fat, muscle, organs), so individuals with the same BMI may have different amounts of body fat. Additionally, BMI cannot provide information about fat distribution, such as whether fat tissue is concentrated in the abdomen or limbs. These are important factors closely related to health status and disease risk.",
        "bmi_4": "While BMI has been widely used as an indicator of obesity in the past, we now have a clearer understanding of its limitations. Therefore, healthcare professionals typically consider BMI along with other indicators such as waist circumference, body fat percentage, lifestyle, and family medical history when assessing an individual's health status. This helps provide a more comprehensive evaluation of an individual's health and develop more appropriate health management plans.",
        "bmi_prime": "BMI Prime",
        "status": "Status"
    },
    "bmr": {
        "bmr_calculator": "BMR Calculator",
        "description": "Calculate Basal Metabolic Rate (BMR).",
        "bmr_1": "Basal Metabolic Rate (BMR) refers to the rate at which the body consumes energy in a resting state, which is the minimum energy required to maintain basic life functions. BMR is typically expressed in calories, representing the minimum amount of calories the body burns each day.",
        "bmr_2": "BMR calculation is based on many factors, including age, gender, height, weight, and body fat percentage. Generally, men have a higher BMR than women, younger people typically have a higher BMR than older people, and height and weight also affect BMR calculation results.",
        "bmr_3": "BMR is crucial for maintaining body functions and health as it represents the minimum calories needed when the body is completely at rest and not performing any activities. Understanding your BMR can help people better set health goals and diet plans, ensuring their daily calorie intake meets the body's needs and avoiding over or under-eating.",
        "bmr_4": "Additionally, many people combine BMR with Total Daily Energy Expenditure (TDEE) to determine their daily calorie intake. TDEE takes into account an individual's activity level, combining BMR with energy consumed in daily activities to provide a more comprehensive energy requirement estimate.",
        "bmr_5": "Basal Metabolic Rate Standards",
        "calories_kg_day": "Calories/kg/day",
        "bmr_6": "Increase Muscle Mass (Weight Training): Increasing muscle mass through weight training is an effective method to boost BMR. Muscle tissue is more metabolically active than fat tissue, so the body needs to consume more calories to control muscle activity or repair. By increasing muscle mass and weight, BMR can be effectively enhanced.",
        "bmr_7": "Aerobic Exercise: Aerobic exercises including interval sprints, swimming, cycling, etc., can effectively increase BMR. Aerobic exercise helps improve cardiovascular function and raises the body's metabolic level, thereby promoting calorie consumption.",
        "bmr_8": "Balanced Diet, Increase Protein Intake: Maintaining a balanced diet and consuming adequate protein and calories is crucial for maintaining BMR. Protein is an essential nutrient for tissue repair and growth, and can also promote BMR increase.",
        "bmr_9": "Adequate Sleep: Maintaining sufficient and regular sleep is crucial for BMR. Irregular sleep patterns may lead to decreased BMR, so ensuring adequate sleep each night is very important for body health and metabolic function.",
        "bmr_10": "Control Sugar Intake: Limiting excessive sugar intake can help control weight and maintain BMR. Excessive sugar intake may lead to weight gain and fat accumulation, affecting normal BMR function. Therefore, reducing sugar intake in food and drinks is an important step in maintaining body health and promoting metabolism.",
        "increase_bmr": "How to Increase BMR",
        "decreased_bmr": "Causes of Decreased BMR",
        "bmr_11": "Age Factor: As we age, our body tissues gradually slow down metabolic activities and functions. This naturally leads to a decrease in BMR.",
        "bmr_12": "Changes in Muscle Mass: Muscle tissue requires energy to maintain normal function. When muscle mass decreases, the body's energy needs also decrease accordingly, affecting BMR.",
        "bmr_13": "Exercise Habits: Reduced exercise frequency may affect BMR. For example, long-term lack of exercise, such as in sedentary work environments, reduces the body's energy needs, thereby lowering BMR.",
        "bmr_14": "Dietary Habits: Incorrect dietary habits may affect metabolism. Consuming too many high-calorie foods or long-term dieting may affect BMR.",
        "bmr_15": "Thyroid Function Abnormalities: The thyroid is a key organ in regulating metabolism. Thyroid abnormalities, such as hyperthyroidism or hypothyroidism, may cause changes in BMR.",
        "bmr_16": "Hormonal Changes: Changes in hormone levels may also affect BMR. For example, hormonal changes in women during menopause may affect BMR."
    },
    "body_fat": {
        "body_fat_calculator": "Body Fat Calculator",
        "description": "Calculate Body Fat Percentage.",
        "body_fat": "Body Fat Percentage",
        "body_fat_1": "In the past, a simple method to assess an individual's obesity level was using the Body Mass Index (BMI), which is calculated by dividing height by the square of weight. While BMI is a common reference indicator, it tends to overlook body fat content. Therefore, to more accurately evaluate an individual's obesity level, in addition to BMI, body fat percentage should also be measured to obtain more objective results.",
        "body_fat_2": "Generally, adult males with a body fat percentage exceeding 25% and adult females exceeding 30% are considered obese; while males with body fat between 15% to 25% and females between 20% to 30% are considered normal. However, these values may vary with age, and generally, body fat percentage tends to increase with age.",
        "body_fat_3": "Although BMI is widely discussed and applied, it has some limitations. For example, BMI values cannot reflect the actual body composition, making it difficult to accurately assess those who have relatively high weight but low body fat content. Therefore, body fat percentage measurement can serve as a complement to BMI, helping people better evaluate and understand their physical health status.",
        "body_fat_4": "Enter neck, waist, and hip (for females) measurements to calculate body fat percentage using the U.S. Navy Method.",
        "body_fat_5": "High Body Fat Percentage",
        "body_fat_6": "Obesity: High body fat percentage can lead to obesity, increasing the risk of various health problems such as heart disease, stroke, diabetes, and certain types of cancer.",
        "body_fat_7": "Metabolic Syndrome: High body fat percentage is often associated with metabolic syndrome, a cluster of conditions including high blood pressure, high blood sugar, abnormal cholesterol levels, and excess abdominal fat. Metabolic syndrome significantly increases the risk of heart disease, stroke, and type 2 diabetes.",
        "body_fat_8": "Insulin Resistance: Excessive body fat can lead to insulin resistance, reducing the body's cells' response to insulin. This can result in high blood sugar levels, eventually leading to type 2 diabetes.",
        "body_fat_9": "High Blood Pressure: Excess body fat, especially visceral fat, can increase blood pressure, leading to hypertension and increasing the risk of heart disease and stroke.",
        "body_fat_10": "Dyslipidemia: High body fat percentage is often associated with abnormal blood lipids, such as high triglycerides and low HDL cholesterol, which increase the risk of cardiovascular disease.",
        "body_fat_11": "Joint Pain: Excessive weight can put pressure on joints, leading to arthritis and joint pain, especially in weight-bearing joints like knees and hips.",
        "body_fat_12": "Sleep Apnea: Obesity-related sleep apnea is a serious sleep disorder where breathing repeatedly stops and starts during sleep, causing fragmented sleep and daytime fatigue.",
        "body_fat_13": "Reduced Quality of Life: High body fat percentage can affect physical activity ability, self-esteem, and overall quality of life. It may also lead to psychological issues such as depression and anxiety.",
        "body_fat_14": "Low Body Fat Percentage",
        "body_fat_15": "Impaired Reproductive Function: Too low body fat percentage can negatively affect sex hormone secretion, impacting reproductive system function and leading to menstrual irregularities or infertility.",
        "body_fat_16": "Osteoporosis: Fat is one of the important sources for calcium absorption in the body. Too low body fat percentage can lead to osteoporosis, increasing the risk of fractures.",
        "body_fat_17": "Decreased Immune Function: Appropriate fat is crucial for immune system function. Too low body fat percentage can decrease immune function, increasing the risk of infections and diseases.",
        "body_fat_18": "Energy Deficiency: Too low body fat percentage can lead to insufficient energy supply, affecting various physiological functions, especially for those who engage in long-term high-intensity exercise.",
        "body_fat_19": "Menstrual Irregularities: Too low body fat percentage in women can lead to menstrual irregularities or amenorrhea, affecting fertility and physical health.",
        "body_fat_20": "Poor Mental State: Too low body fat percentage can affect brain function, leading to mood swings, anxiety, and depression.",
        "body_fat_21": "Muscle Loss: Too low body fat percentage can lead to muscle loss, affecting body strength and endurance.",
        "body_fat_22": "Malnutrition: Too low body fat percentage may indicate that the body is in a state of malnutrition, affecting the absorption and utilization of various nutrients.",
        "body_fat_category": "Body Fat Categories",
        "healthy_body_fat_ranges_for_adults": "Healthy Body Fat Ranges for Adults",
        "essential_fat": "Essential Fat",
        "athletes": "Athletes",
        "fitness": "Fitness",
        "average": "Average",
        "obese": "Obese",
        "american_body_fat_categorization": "American Council on Exercise Body Fat Categorization",
        "underfat": "Underfat",
        "healthy": "Healthy",
        "overfat": "Overfat",
        "women": "Women",
        "men": "Men",
        "body_fat_23": "Tania has established the following standards based on DEXA gold standard and related research (these standards apply to Asians and Caucasians)",
        "description_text": "Description"
    },
    "tdee": {
        "tdee_calculator": "TDEE Calculator",
        "grid_description": "Calculate Total Daily Energy Expenditure.",
        "tdee": "TDEE",
        "tdee_level_1": "Little/no exercise (sedentary lifestyle)",
        "tdee_level_2": "Light exercise 1-2 times/week",
        "tdee_level_3": "Moderate exercise 2-3 times/week",
        "tdee_level_4": "Hard exercise 4-5 times/week",
        "tdee_level_5": "Physical labor or hard exercise 6-7 times/week",
        "tdee_level_6": "Very hard exercise daily, or physical labor",
        "tdee_1": "Total Daily Energy Expenditure (TDEE) refers to the total amount of energy a person expends in one day. This metric is particularly important for those who want to manage their weight, as it helps you understand how many calories you need to maintain your weight, or how many calories you need to adjust for weight gain or loss.",
        "tdee_2": "Components of TDEE",
        "tdee_3": "Basal Metabolic Rate (BMR)",
        "tdee_4": "Thermic Effect of Food (TEF)",
        "tdee_5": "Exercise Activity Thermogenesis (EAT)",
        "tdee_6": "Non-Exercise Activity Thermogenesis (NEAT)",
        "tdee_7": "BMR refers to the energy required by the body to maintain basic life functions in a completely resting state, such as breathing, heartbeat, and temperature regulation. BMR is influenced by factors such as age, gender, weight, and muscle mass.",
        "tdee_8": "When we eat, the body needs energy to digest, absorb, and metabolize food. TEF accounts for about 10% of total energy expenditure. Different types of food have different effects on TEF, with protein having the highest TEF, followed by carbohydrates and fats.",
        "tdee_9": "EAT refers to the energy consumed through planned exercise, such as running, weightlifting, swimming, etc. The amount and intensity of exercise directly affect the EAT value.",
        "tdee_10": "NEAT includes all energy consumed through non-exercise physical activities, such as walking, standing, cleaning, etc. NEAT varies greatly depending on individual lifestyle and occupation.",
        "tdee_formula": "TDEE Formula",
        "activity": "Activity"
    },
    "age_page": {
        "age_calculator": "Age Calculator",
        "grid_description": "Calculate age.",
        "birth_date": "Birth Date",
        "current_date": "Current Date",
        "age": "Age",
        "years": "years",
        "months": "months",
        "days": "days",
        "weeks": "weeks",
        "hours": "hours",
        "minutes": "minutes",
        "seconds": "seconds",
        "total_months": "Total Months",
        "total_weeks": "Total Weeks",
        "total_days": "Total Days",
        "total_hours": "Total Hours",
        "total_minutes": "Total Minutes",
        "total_seconds": "Total Seconds",
        "age_description": "Welcome to the Age Calculator! This is a precise and easy-to-use online tool that quickly calculates your age based on your birth date. Whether you need to display your age in years, months, days, weeks, hours, minutes, or seconds, the Age Calculator meets your needs. Additionally, it calculates the total months, weeks, days, hours, minutes, and seconds from your birth to the present."
    },
    "neck": "Neck",
    "waist": "Waist",
    "hip": "Hip",
    "metric_units": "Metric",
    "imperial_units": "Imperial",
    "height": "Height",
    "weight": "Weight",
    "calculate": "Calculate",
    "age": "Age",
    "gender": "Gender",
    "male": "Male",
    "female": "Female",
    "equation": "Equation",
    "metadata": {
        "bmi_calculator_title": "BMI Calculator",
        "bmi_calculator_description": "Since BMI does not account for body fat percentage, a person with a high BMI may not necessarily be obese. For example, bodybuilders may have a BMI over 30 due to their higher proportion of muscle mass. If their body fat percentage is low, they may not need to lose weight. This indicates that BMI is only a rough indicator and cannot fully reflect body composition and health status.",
        "bmi_calculator_keywords": "BMI,Body Mass Index,Weight Index,Body Composition Index,Health Index,Obesity Index,Weight Calculation,Health Assessment,Body Fat Percentage,Weight Management,Health Management,Body Assessment,Weight Standards,Health Standards,Obesity Standards,Underweight,Normal Weight,Overweight,Obesity Classification,Health Indicators,Body Composition",
        "bmr_calculator_title": "BMR Calculator",
        "bmr_calculator_description": "Basal Metabolic Rate (BMR) refers to the rate at which the body consumes energy in a resting state, which is the minimum energy required to maintain basic life functions. BMR is typically expressed in calories, representing the minimum amount of calories the body burns each day.",
        "bmr_calculator_keywords": "BMR,Basal Metabolic Rate,Basal Metabolism,Metabolic Rate,Metabolism,Energy Consumption,Energy Requirements,Energy Requirement Estimation,Energy Requirement Calculation,Energy Requirement Estimate,Energy Requirement Calculation Value,Energy Requirement Estimation Formula,Energy Requirement Calculation Formula,Energy Requirement Estimation Formula Value,Energy Requirement Calculation Formula Value",
        "body_fat_calculator_title": "Body Fat Calculator",
        "body_fat_calculator_description": "The Body Fat Calculator is a tool used to estimate body fat percentage. It calculates body fat percentage based on various body measurements such as height, weight, waist, and hip circumference using specific formulas.",
        "body_fat_calculator_keywords": "Body Fat Calculator,Body Fat Percentage,Body Fat Rate,Body Fat Calculation,Body Fat Estimation,Body Fat Estimation Formula,Body Fat Estimation Value,Body Fat Calculation Formula,Body Fat Calculation Value,Body Fat Estimation Formula Value,Body Fat Calculation Formula Value",
        "tdee_calculator_title": "TDEE Calculator",
        "tdee_calculator_description": "The TDEE Calculator is a tool used to estimate the total daily energy expenditure of the human body. It calculates the total daily energy expenditure based on various factors such as age, gender, weight, height, body fat percentage, and exercise level using specific formulas.",
        "tdee_calculator_keywords": "TDEE,Total Daily Energy Expenditure,Energy Expenditure,Energy Requirements,Energy Requirement Estimation,Energy Requirement Calculation,Energy Requirement Estimate,Energy Requirement Calculation Value,Energy Requirement Estimation Formula,Energy Requirement Calculation Formula,Energy Requirement Estimation Formula Value,Energy Requirement Calculation Formula Value",
        "age_calculator_title": "Age Calculator",
        "age_calculator_description": "The Age Calculator is an online tool specifically designed to calculate your precise age based on your birth date. Whether you're looking for your exact age in years, months, days, weeks, hours, minutes, or seconds, this tool provides detailed data. It not only displays your current age but also calculates the total months, weeks, days, hours, minutes, and seconds from your birth to the present. This age calculator is an ideal choice for obtaining comprehensive age analysis, perfect for personal use or professional settings such as birthday planning or preparation for specific events.",
        "age_calculator_keywords": "Age Calculator,Age Calculation,Age Estimation,Age Estimation Formula,Age Estimation Value,Age Calculation Formula,Age Calculation Value,Age Estimation Formula Value,Age Calculation Formula Value"
    }
}